



NETCONF                                                          E. Voit
Internet-Draft                                             Cisco Systems
Intended status: Standards Track                                A. Clemm
Expires: June 25, 2018                                            Huawei
                                                      A. Gonzalez Prieto
                                                                  VMWare
                                                       E. Nilsen-Nygaard
                                                             A. Tripathy
                                                           Cisco Systems
                                                       December 22, 2017


                  Custom Subscription to Event Streams
             draft-ietf-netconf-subscribed-notifications-08

Abstract

   This document defines capabilities and operations for the customized
   establishment of subscriptions upon a publisher's event streams.
   Also defined are delivery mechanisms for instances of the resulting
   notification messages.  Effectively this allows a subscriber to
   request and receive a continuous, custom feed of publisher generated
   information.

Status of This Memo

   This Internet-Draft is submitted in full conformance with the
   provisions of BCP 78 and BCP 79.

   Internet-Drafts are working documents of the Internet Engineering
   Task Force (IETF).  Note that other groups may also distribute
   working documents as Internet-Drafts.  The list of current Internet-
   Drafts is at https://datatracker.ietf.org/drafts/current/.

   Internet-Drafts are draft documents valid for a maximum of six months
   and may be updated, replaced, or obsoleted by other documents at any
   time.  It is inappropriate to use Internet-Drafts as reference
   material or to cite them other than as "work in progress."

   This Internet-Draft will expire on June 25, 2018.

Copyright Notice

   Copyright (c) 2017 IETF Trust and the persons identified as the
   document authors.  All rights reserved.

   This document is subject to BCP 78 and the IETF Trust's Legal
   Provisions Relating to IETF Documents



Voit, et al.              Expires June 25, 2018                 [Page 1]

Internet-Draft          Subscribed Notifications           December 2017


   (https://trustee.ietf.org/license-info) in effect on the date of
   publication of this document.  Please review these documents
   carefully, as they describe your rights and restrictions with respect
   to this document.  Code Components extracted from this document must
   include Simplified BSD License text as described in Section 4.e of
   the Trust Legal Provisions and are provided without warranty as
   described in the Simplified BSD License.

Table of Contents

   1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . .   2
     1.1.  Motivation  . . . . . . . . . . . . . . . . . . . . . . .   3
     1.2.  Terminology . . . . . . . . . . . . . . . . . . . . . . .   3
     1.3.  Solution Overview . . . . . . . . . . . . . . . . . . . .   4
     1.4.  Relationship to RFC-5277  . . . . . . . . . . . . . . . .   6
   2.  Solution  . . . . . . . . . . . . . . . . . . . . . . . . . .   6
     2.1.  Event Streams . . . . . . . . . . . . . . . . . . . . . .   6
     2.2.  Event Stream Filters  . . . . . . . . . . . . . . . . . .   7
     2.3.  QoS . . . . . . . . . . . . . . . . . . . . . . . . . . .   7
     2.4.  Dynamic Subscriptions . . . . . . . . . . . . . . . . . .   8
     2.5.  Configured Subscriptions  . . . . . . . . . . . . . . . .  13
     2.6.  Event Record Delivery . . . . . . . . . . . . . . . . . .  18
     2.7.  Subscription State Notifications  . . . . . . . . . . . .  18
     2.8.  Subscription Monitoring . . . . . . . . . . . . . . . . .  22
     2.9.  Advertisement . . . . . . . . . . . . . . . . . . . . . .  22
   3.  YANG Data Model Trees . . . . . . . . . . . . . . . . . . . .  23
     3.1.  Event Streams Container . . . . . . . . . . . . . . . . .  23
     3.2.  Event Stream Filters Container  . . . . . . . . . . . . .  23
     3.3.  Subscriptions Container . . . . . . . . . . . . . . . . .  23
     3.4.  Subscription-config Container . . . . . . . . . . . . . .  25
   4.  Data Model  . . . . . . . . . . . . . . . . . . . . . . . . .  25
   5.  Considerations  . . . . . . . . . . . . . . . . . . . . . . .  51
     5.1.  Implementation Considerations . . . . . . . . . . . . . .  51
     5.2.  IANA Considerations . . . . . . . . . . . . . . . . . . .  52
     5.3.  Security Considerations . . . . . . . . . . . . . . . . .  52
   6.  Acknowledgments . . . . . . . . . . . . . . . . . . . . . . .  53
   7.  References  . . . . . . . . . . . . . . . . . . . . . . . . .  54
     7.1.  Normative References  . . . . . . . . . . . . . . . . . .  54
     7.2.  Informative References  . . . . . . . . . . . . . . . . .  55
   Appendix A.  Changes between revisions  . . . . . . . . . . . . .  55
   Authors' Addresses  . . . . . . . . . . . . . . . . . . . . . . .  58

1.  Introduction

   This document defines capabilities and operations for the customized
   establishment of subscriptions upon system generated event streams.
   Effectively this enables a "subscribe then publish" capability where
   the customized information needs of each target receiver are



Voit, et al.              Expires June 25, 2018                 [Page 2]

Internet-Draft          Subscribed Notifications           December 2017


   understood by the publisher before subscribed event records are
   marshalled and pushed.  The receiver then gets a continuous, custom
   feed of publisher generated information.

   While the functionality defined in this document is transport-
   agnostic, protocols like NETCONF [RFC6241] or RESTCONF [RFC8040] can
   be used to configure or dynamically signal subscriptions, and there
   are bindings defined for subscribed event record delivery for NETCONF
   within [I-D.draft-ietf-netconf-netconf-event-notifications], and for
   HTTP2 or HTTP1.1 within [I-D.draft-ietf-netconf-restconf-notif].

1.1.  Motivation

   There are various [RFC5277] limitations, many of which have been
   exposed in [RFC7923] which needed to be solved.  Key capabilities
   supported by this document include:

   o  multiple subscriptions on a single transport session

   o  support for dynamic and statically configured subscriptions

   o  modification of an existing subscription

   o  operational counters and instrumentation

   o  negotiation of subscription parameters (through the use of hints
      returned as part of declined subscription requests)

   o  state change notifications (e.g., publisher driven suspension,
      parameter modification)

   o  independence from transport protocol

1.2.  Terminology

   The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT",
   "SHOULD", "SHOULD NOT", "RECOMMENDED", "MAY", and "OPTIONAL" in this
   document are to be interpreted as described in RFC 2119 [RFC2119].

   Configured subscription: A subscription installed via a configuration
   interface which persists across reboots.

   Dynamic subscription: A subscription agreed between subscriber and
   publisher created via an establish-subscription RPC.

   Event: An occurrence of something that may be of interest. (e.g., a
   configuration change, a fault, a change in status, crossing a
   threshold, or an external input to the system.)



Voit, et al.              Expires June 25, 2018                 [Page 3]

Internet-Draft          Subscribed Notifications           December 2017


   Event record: A set of information detailing an event.

   NACM: NETCONF Access Control Model.

   Notification message: A set of transport encapsulated information
   intended for a receiver indicating that one or more event(s) have
   occurred.  A notification message may bundle multiple event records.
   This includes the bundling multiple, independent RFC 7950 YANG
   notifications.

   Publisher: An entity responsible for streaming notification messages
   per the terms of a Subscription.

   Receiver: A target to which a publisher pushes subscribed event
   records.  For dynamic subscriptions, the receiver and subscriber are
   the same entity.

   Stream (also referred to as "event stream"): A continuous ordered set
   of events aggregated under some context.

   Stream filter: Evaluation criteria which may be applied against event
   records within a stream.  Event records pass the filter when
   specified criteria are met.

   Subscribed event records: Event records which have met the terms of
   the subscription.  This include terms (such as security checks)
   enforced by the publisher.

   Subscriber: An entity able to request and negotiate a contract for
   the generation and push of event records from a publisher.

   Subscription: A contract with a publisher, stipulating which
   information one or more receivers wish to have pushed from the
   publisher without the need for further solicitation.

1.3.  Solution Overview

   This document describes a transport agnostic mechanism for
   subscribing to and receiving content from a stream instantiated
   within a publisher.  This mechanism is through the use of a
   subscription.

   Two types of subscriptions are supported:

   1.  Dynamic subscriptions, where a subscriber initiates a
       subscription negotiation with a publisher via RPC.  If the
       publisher wants to serve this request, it accepts it, and then
       starts pushing notification messages.  If the publisher does not



Voit, et al.              Expires June 25, 2018                 [Page 4]

Internet-Draft          Subscribed Notifications           December 2017


       wish to serve it as requested, then an error response is
       returned.  This response MAY include hints at subscription
       parameters which would have been accepted.

   2.  Configured subscriptions, which allow the management of
       subscriptions via a configuration interface so that a publisher
       can send notification messages to configured receiver(s).
       Support for this capability is optional.

   Additional characteristics differentiating configured from dynamic
   subscriptions include:

   o  The lifetime of a dynamic subscription is bounded by the transport
      session used to establish it.  For connection-oriented stateful
      transport like NETCONF, the loss of the transport session will
      result in the immediate termination of any associated dynamic
      subscriptions.  For connectionless or stateless transports like
      HTTP, a lack of receipt acknowledgement of a sequential set of
      notification messages and/or keep-alives can be used to trigger a
      termination of a dynamic subscription.  Contrast this to the
      lifetime of a configured subscription.  This lifetime is driven by
      relevant configuration being present within the publisher's
      running configuration.  Being tied to configuration operations
      implies configured subscriptions can be configured to persist
      across reboots, and implies a configured subscription can persist
      even when its publisher is fully disconnected from any network.

   o  Configured subscriptions can be modified by any configuration
      client with write permission on the configuration of the
      subscription.  Dynamic subscriptions can only be modified via an
      RPC request made by the original subscriber.

   Note that there is no mixing-and-matching of dynamic and configured
   operations on a single subscriptions.  Specifically, a configured
   subscription cannot be modified or deleted using RPCs defined in this
   document.  Similarly, a subscription established via RPC cannot be
   modified through configuration operations.  Also note that transport
   specific transport drafts based on this specification MUST detail the
   life cycles of both dynamic and configured subscriptions.

   The publisher MAY decide to terminate a dynamic subscription at any
   time.  Similarly, it MAY decide to temporarily suspend the sending of
   notification messages for any dynamic subscription, or for one or
   more receivers of a configured subscription.  Such termination or
   suspension is driven by internal considerations of the publisher.






Voit, et al.              Expires June 25, 2018                 [Page 5]

Internet-Draft          Subscribed Notifications           December 2017


1.4.  Relationship to RFC-5277

   This document is intended to provide a superset of the subscription
   capabilities initially defined within [RFC5277].  Especially when
   extending an existing [RFC5277] implementation, it is important to
   understand what has been reused and what has been replaced.  Key
   relationships between these two documents include:

   o  the data model in this document replaces the data model in
      [RFC5277].

   o  the RPC operations in this draft replaces the symmetrical
      operations of [RFC5277], section 4.

   o  the one way operation of [RFC5277] is still used.  However this
      operation will no longer be required with the availability of
      [I.D.draft-ietf-netconf-notification-messages].

   o  the definition and contents of the NETCONF stream are identical
      between this document and [RFC5277].

   o  a publisher MAY implement both the data model and RPCs defined in
      [RFC5277] and this new document concurrently, in order to support
      old clients.  However the use of both alternatives on a single
      transport session is prohibited.

2.  Solution

2.1.  Event Streams

   An event stream is a named entity on a publisher which exposes a
   continuously updating set of event records.  Each event stream is
   available for subscription.  It is out of the scope of this document
   to identify a) how streams are defined, b) how event records are
   defined/generated, and c) how event records are assigned to streams.

   There is only one reserved event stream within this document:
   NETCONF.  The NETCONF event stream contains all NETCONF XML event
   record information supported by the publisher, except for where it
   has been explicitly indicated that this the event record MUST be
   excluded from the NETCONF stream.  The NETCONF stream will include
   individual YANG notifications as per [RFC7950] section 7.16.  Each of
   these YANG notifications will be treated a distinct event record.
   Beyond the NETCONF stream, implementations are free to add additional
   event streams.

   As event records are created by a system, they may be assigned to one
   or more streams.  The event record is distributed to subscription's



Voit, et al.              Expires June 25, 2018                 [Page 6]

Internet-Draft          Subscribed Notifications           December 2017


   receiver(s) where: (1) a subscription includes the identified stream,
   and (2) subscription filtering does not exclude the event record from
   that receiver.

   If access control permissions are in use to secure publisher content,
   then for event records to be sent to a receiver, that receiver MUST
   be allowed access to all the event records on the stream.  If
   subscriber permissions change during the lifecycle of a subscription,
   then the subscription MUST be continued or terminated accordingly.

2.2.  Event Stream Filters

   This document defines an extensible filtering mechanism.  Two
   optional stream filtering syntaxes supported are [XPATH] and subtree
   [RFC6241].  A filter always removes a complete event record; a subset
   of information is never stripped from an event record.

   If no stream filter is provided within a subscription, all event
   records on a stream are to be sent.

2.3.  QoS

   This document provides an optional feature describing QoS parameters.
   These parameters indicate the treatment of a subscription relative to
   other traffic between publisher and receiver.  Included are:

   o  A "dscp" QoS marking to differentiate transport QoS behavior.
      Where provided, this marking MUST be stamped on notification
      messages.

   o  A "weighting" so that bandwidth proportional to this weighting can
      be allocated to this subscription relative to other subscriptions
      destined for that receiver.

   o  a "dependency" upon another subscription.  Notification messages
      MUST NOT be sent prior to other notification messages containing
      update record(s) for the referenced subscription.

   A subscription's weighting MUST work identically to stream dependency
   weighting as described within RFC 7540, section 5.3.2.

   A subscription's dependency MUST work identically to stream
   dependency as described within [RFC7540], sections 5.3.1, 5.3.3, and
   5.3.4.  If a dependency is attempted via an RPC, but the referenced
   subscription does not exist, the dependency will be silently removed.






Voit, et al.              Expires June 25, 2018                 [Page 7]

Internet-Draft          Subscribed Notifications           December 2017


2.4.  Dynamic Subscriptions

   Dynamic subscriptions are managed via RPC, and are made against
   targets located within the publisher.  These RPCs have been designed
   extensibly so that they may be augmented for subscription targets
   beyond event streams.

2.4.1.  Dynamic Subscription State Model

   Below is the publisher's state machine for a dynamic subscription.
   It is important to note that such a subscription doesn't exist at the
   publisher until it an "establish-subscription" RPC is accepted.  The
   mere request by a subscriber to establish a subscription is
   insufficient for that asserted subscription to be externally visible.

                       .-------.
                       | start |
                       '-------'
                           |
                  establish-subscription
                           |
                           |   .------modify-subscription-------.
                           v   v                                '
                     .-----------.                         .-----------.
          .--------. | receiver  |-subscription-suspended->| receiver  |
        modify-     '|  active   |                         | suspended |
        subscription |           |<--subscription-resumed--|           |
          ---------->'-----------'                         '-----------'
                           |                                    |
                delete/kill-subscription                   delete/kill-
                           |                               subscription
                           v                                    |
                       .-------.                                |
                       |  end  |<-------------------------------'
                       '-------'

                        Dynamic subscription state

   Of interest in this state machine are the following:

   o  Successful establish or modify RPCs put the subscription into an
      active state.

   o  Failed modify RPCs will leave the subscription in its previous
      state, with no visible change to any streaming updates.

   o  A delete or kill RPC will end the subscription.




Voit, et al.              Expires June 25, 2018                 [Page 8]

Internet-Draft          Subscribed Notifications           December 2017


   o  Suspend and resume state changes are driven by internal process
      and prioritization.  There are no direct controls over suspend and
      resume other than modifying a subscription

2.4.2.  Establishing a Subscription

   The "establish-subscription" operation allows a subscriber to request
   the creation of a subscription via RPC.  It MUST be possible to
   support multiple establish subscription RPC requests made within the
   same transport session.

   The input parameters of the operation are:

   o  A stream name which identifies the targeted stream of events
      against which the subscription is applied.

   o  A stream filter which may reduce the set of event records pushed.

   o  An optional encoding for the event records pushed.  Note: If no
      encoding is included, the encoding of the RPC MUST be used.

   o  An optional stop time for the subscription.  If no stop-time is
      present, notification messages will continue to be sent until the
      subscription is terminated.

   o  An optional start time which indicates that this subscription is
      requesting a replay of previously generated information from the
      event stream.  For more on replay, see Section 2.4.2.1

   If the publisher can satisfy the "establish-subscription" request, it
   provides an identifier for the subscription, and immediately starts
   streaming notification messages.  If the subscriber has no
   authorization to establish the subscription, transport protocol
   specific replies are used to indicate an authorization error.  If an
   RPC request is properly framed, but publisher cannot satisfy the
   "establish-subscription" request, the publisher MUST send a negative
   "subscription-result" element describing the reason for the failure.
   Optionally, the "subscription-result" MAY be accompanied by one or
   more hints on alternative inputs which would have resulted in an
   accepted subscription.

   "establish-subscription" requests MUST fail if a filter with invalid
   or unsupportable syntax is provided, or if a non-existent stream is
   referenced.







Voit, et al.              Expires June 25, 2018                 [Page 9]

Internet-Draft          Subscribed Notifications           December 2017


    +---x establish-subscription
       +---w input
       |  +---w encoding?                encoding
       |  +---w (target)
       |  |  +--:(stream)
       |  |     +---w (stream-filter)?
       |  |     |  +--:(by-reference)
       |  |     |  |  +---w stream-filter-ref        stream-filter-ref
       |  |     |  +--:(within-subscription)
       |  |     |     +---w (filter-spec)?
       |  |     |        +--:(stream-subtree-filter)
       |  |     |        |  +---w stream-subtree-filter?    {subtree}?
       |  |     |        +--:(stream-xpath-filter)
       |  |     |           +---w stream-xpath-filter?
       |  |     |                                 yang:xpath1.0 {xpath}?
       |  |     +---w stream?               stream-ref
       |  |     +---w replay-start-time?    yang:date-and-time {replay}?
       |  +---w stop-time?               yang:date-and-time
       |  +---w dscp?                    inet:dscp {qos}?
       |  +---w weighting?               uint8 {qos}?
       |  +---w dependency?              sn:subscription-id {qos}?
       +--ro output
          +--ro subscription-result       subscription-result
          +--ro (result)?
             +--:(no-success)
             |  +--ro filter-failure?           string
             |  +--ro replay-start-time-hint?   yang:date-and-time
             +--:(success)
                +--ro identifier                subscription-id

                   Figure 1: establish-subscription RPC

2.4.2.1.  Replay Subscription

   Replay provides the ability to establish a subscription which is also
   capable of passing recently generated event records.  In other words,
   as the subscription initializes itself, it sends any previously
   generated content from within target event stream which meets the
   filter and timeframe criteria.  These historical event records would
   then be followed by event records generated after the subscription
   has been established.  All event records will be delivered in the
   order generated.

   Replay is an optional feature which is dependent on an event stream
   supporting some form of logging.  Replay puts no restrictions on the
   size or form of the log, or where it resides within the device.





Voit, et al.              Expires June 25, 2018                [Page 10]

Internet-Draft          Subscribed Notifications           December 2017


   The inclusion of a replay-start-time within an "establish-
   subscription" RPC indicates a replay request.  If the "replay-start-
   time" contains a value that is earlier than content stored within the
   publisher's replay buffer, then the subscription MUST be rejected,
   and the leaf "replay-start-time-hint" MUST be set in the reply.

   If a "stop-time" parameter is included, it MAY also be earlier than
   the current time and MUST be later than the "replay-start-time".  The
   publisher MUST NOT accept a "replay-start-time" for a future time.

   If the "replay-start-time" is later than any information stored in
   the replay buffer, then the publisher MUST send a "replay-completed"
   notification immediately after the "subscription-started"
   notification.

   If a stream supports replay, the "replay-support" leaf is present in
   the "/streams/stream" list entry for the stream.  An event stream
   that does support replay is not expected to have an unlimited supply
   of saved notifications available to accommodate any given replay
   request.  To assess the availability of replay, subscribers can
   perform a get on "replay-log-creation-time" and "replay-log-aged-
   time".  See Figure 8 for the tree describing these elements.  The
   actual size of the replay log at any given time is a publisher
   specific matter.  Control parameters for the replay log are outside
   the scope of this document.

2.4.3.  Modifying a Subscription

   The "modify-subscription" operation permits changing the terms of an
   existing dynamic subscription previously established on that
   transport session via "establish-subscription".  Dynamic
   subscriptions can be modified one or multiple times.  If the
   publisher accepts the requested modifications, it replies with "ok"
   in the "subscription-result", then immediately starts sending event
   records based on the new terms.  If the publisher rejects the
   request, the subscription remains as prior to the request.  That is,
   the request has no impact whatsoever.  The contents of a such a
   rejected modification MAY include one or more hints on alternative
   inputs which would have resulted in a successfully modified
   subscription.

   If the publisher accepts the requested modifications on a currently
   suspended subscription, the subscription will immediately be resumed
   (i.e., the modified subscription is returned to an active status.)
   The publisher MAY immediately suspend this newly modified
   subscription through the "subscription-suspended" notification before
   any event records are sent.




Voit, et al.              Expires June 25, 2018                [Page 11]

Internet-Draft          Subscribed Notifications           December 2017


    +---x modify-subscription
       +---w input
       |  +---w identifier?              subscription-id
       |  +---w (target)
       |  |  +--:(stream)
       |  |     +---w (stream-filter)?
       |  |        +--:(by-reference)
       |  |        |  +---w stream-filter-ref        stream-filter-ref
       |  |        +--:(within-subscription)
       |  |           +---w (filter-spec)?
       |  |              +--:(stream-subtree-filter)
       |  |              |  +---w stream-subtree-filter?    {subtree}?
       |  |              +--:(stream-xpath-filter)
       |  |                 +---w stream-xpath-filter?
       |  |                                       yang:xpath1.0 {xpath}?
       |  +---w stop-time?               yang:date-and-time
       +--ro output
          +--ro subscription-result    subscription-result
          +--ro (result)?
             +--:(no-success)
                +--ro filter-failure?        string

                     Figure 2: modify-subscription RPC

   Dynamic subscriptions established via RPC can only be modified via
   RPC using the same transport session used to establish that
   subscription.  Subscriptions created by configuration operations
   cannot be modified via this RPC.

2.4.4.  Deleting a Subscription

   The "delete-subscription" operation permits canceling an existing
   subscription previously established on that transport session.  If
   the publisher accepts the request, and the publisher has indicated
   this success via an "ok" in the "subscription-result", the publisher
   MUST NOT send any more notification messages for this subscription.
   If the publisher rejects the request, the request has no impact
   whatsoever on any subscription.

       +---x delete-subscription
          +---w input
          |  +---w identifier    subscription-id
          +--ro output
             +--ro subscription-result    subscription-result

                     Figure 3: delete-subscription RPC





Voit, et al.              Expires June 25, 2018                [Page 12]

Internet-Draft          Subscribed Notifications           December 2017


   Dynamic subscriptions can only be deleted via this RPC using the same
   transport session previously used for subscription establishment.
   Configured subscriptions cannot be deleted using RPCs.

2.4.5.  Killing a Subscription

   The "kill-subscription" operation permits an operator to end a
   dynamic subscription which is not associated with the transport
   session used for the RPC.  This operation MUST be secured so that
   only connections with sufficiently privileged access rights are able
   to invoke this RPC.  A publisher MUST terminate any dynamic
   subscription identified by RPC request.  An operator may find
   subscription identifiers which may be used with "kill-subscription"
   by searching for the IP address of a receiver within
   "subscriptions\subscription\receivers\receiver\address".

   Configured subscriptions cannot be killed using this RPC.  Instead,
   configured subscriptions are deleted as part of regular configuration
   operations.  Publishers MUST reject any RPC attempt to kill a
   configured subscription.

   The tree structure of "kill-subscription" is almost identical to
   "delete-subscription", with only the name of the RPC changing.

2.5.  Configured Subscriptions

   A configured subscription is a subscription installed via a
   configuration interface.  Configured subscriptions may be modified by
   any configuration client with the proper permissions.  Subscriptions
   can be modified or terminated via the configuration interface at any
   point of their lifetime.

   Configured subscriptions have several characteristics distinguishing
   them from dynamic subscriptions:

   o  persistence across reboots,

   o  persistence even when transport is unavailable, and

   o  an ability to send notification messages to more than one receiver
      (note that the publisher does not provide information to a
      receiver about other receivers.)

   Supporting configured subscriptions is optional and advertised using
   the "configured" feature.






Voit, et al.              Expires June 25, 2018                [Page 13]

Internet-Draft          Subscribed Notifications           December 2017


   In addition to subscription parameters available to dynamic
   subscriptions as described in Section 2.4.2, the following additional
   parameters are also available to configured subscriptions:

   o  One or more receiver IP addresses (and corresponding ports)
      intended as the destination for notification messages.

   o  Optional parameters to identify an egress interface, a host IP
      address, a VRF (as defined by the network instance name within
      [I-D.draft-ietf-rtgwg-ni-model]), or an IP address plus VRF out of
      which notification messages are to be pushed from the publisher.
      Where any of this info is not explicitly included, or where just
      the VRF is provided, notification messages MUST egress the
      publisher's default interface towards that receiver.

2.5.1.  Configured Subscription State Model

   Below is the state machine for a configured subscription.  The
   creation or modification of a configured subscription initiates a
   publisher evaluation to determine if the subscription is valid or
   invalid.  The publisher uses its own criteria in making this
   determination.  If valid, the subscription becomes operational.

 .-------.
 | start |-.
 '-------' |
      create  .---modify-----.----------------------------------.
           |  |              |                                  |
           V  V          .-------.         .-----.         .---------.
  .----[evaluate]--no--->|invalid|-delete->| end |<-delete-|concluded|
  |                      '-------'         '-----'         '---------'
  |----[evaluate]--no-.      ^                ^                 ^
  |        ^          |      |                |                 |
 yes       |          '->unsupportable      delete           stop-time
  |      modify         (subscription-   (subscription-   (subscription-
  |        |              terminated)      terminated)      concluded)
  |        |                 |                |                 |
  |   .---------------------------------------------------------------.
  '-->|                         valid                                 |
      '---------------------------------------------------------------'

                      Configured subscription status.

   A valid subscription may become invalid on one of two ways.  First,
   it may be modified in a way which fails a re-evaluation.  Second, the
   publisher itself might itself determine that the subscription in no
   longer supportable.  In either case, a "subscription-terminated"
   notification is sent to any active or suspended receivers.  A valid



Voit, et al.              Expires June 25, 2018                [Page 14]

Internet-Draft          Subscribed Notifications           December 2017


   subscription may also transtion to a concluded status if a configured
   stop time has been reached.  In this case, a "subscription-concluded"
   is sent to any active or suspended receivers.

   During any times a subscription is considered valid, a publisher will
   attempt to connect with all configured receivers and deliver
   notification messages.  Below is the state machine for each receiver
   of a configured subscription.  This receiver state machine itself is
   fully contained within the state machine of the configured
   subscription, and is only relevant when the configured subscription
   itself is determined to be valid.

      .----------------------------------------------------------------.
      |                         valid                                  |
      |   .----------.                           .--------.            |
      |   | receiver |------------------timeout->|receiver|            |
      |   |connecting|<------------------reset---|timeout |            |
      |   |          |<-transport---.            '--------'            |
      |   '----------'  loss,reset  |                                  |
      |       |           |         |                                  |
      | (subscription     |         |                                  |
      |  started)    .--------.     |                      .---------. |
      |       '----->|        |     '----------------------|         | |
      |              |receiver|-(subscription-suspended)-->|receiver | |
      |(subscription-| active |                            |suspended| |
      |   modified)  |        |<-(subscription-resumed,----|         | |
      |        '---->'--------'   subscription-modified)   '---------' |
      '----------------------------------------------------------------'

                         Configured receiver state

   When a subscription first becomes valid, the operational status of
   each receiver is initialized to connecting.  Individual are receivers
   are moved to an active status when a "subscription-started" state
   change notification is successfully passed to that receiver.
   Configured receivers remain active if transport connectivity is not
   lost, and event records are not being dropped due to a publisher
   buffer overflow.  A configured subscription's receiver MUST be moved
   to connecting if transport connectivity is lost, or if the receiver
   is reset via configuration operations.

   A configured subscription's receiver MUST be moved to a suspended
   state if there is transport connectivity between the publisher and
   receiver, but notification messages are not being generated for that
   receiver.  A configured subscription receiver MUST be returned to an
   active state from the suspended state when notification messages are
   again being generated and a receiver has successfully been sent a
   "subscription-resumed" or a "subscription-modified".



Voit, et al.              Expires June 25, 2018                [Page 15]

Internet-Draft          Subscribed Notifications           December 2017


   Modification of a configured subscription is possible at any time.  A
   "subscription-modified" state change notification will be sent to all
   active receivers, immediately followed by notification messages
   conforming to the new parameters.  Suspended receivers will also be
   informed of the modification.  However this notification will await
   the end of the suspension for that receiver.

   The mechanisms described above is mirrored in the RPCs and YANG
   notifications within the document.  It should be noted that these
   RPCs and YANG notifications have been designed to be extensible and
   allow subscriptions into targets other than event streams.
   [I-D.ietf-netconf-yang-push] provides an example of such an
   extension.

2.5.2.  Creating a Configured Subscription

   Configured subscriptions are established using configuration
   operations against the top-level subtree "subscription-config".
   There are two key differences between the new RPCs defined in this
   document and configuration operations for subscription creation.
   Firstly, configuration operations install a subscription without
   question, while the RPCs are designed to the support negotiation and
   rejection of requests.  Secondly, while the RPCs mandate that the
   subscriber establishing the subscription is the only receiver of the
   notification messages, configuration operations permit specifying
   receivers independent of any tracked subscriber.  Because there is no
   explicit association with an existing transport session,
   configuration operations require additional parameters beyond those
   of dynamic subscriptions to indicate receivers, and possibly whether
   the notification messages need to come from a specific egress
   interface on the publisher.

   After a subscription is successfully created, the publisher
   immediately sends a "subscription-started" state change notification
   to each receiver.  It is quite possible that upon configuration,
   reboot, or even steady-state operations, a transport session may not
   be currently available to the receiver.  In this case, when there is
   something to transport for an active subscription, transport specific
   call-home operations will be used to establish the connection.  When
   transport connectivity is available, notification messages may then
   be pushed.

   With active configured subscriptions, it is allowable to buffer event
   records even after a "subscription-started" has been sent.  However
   if events are lost (rather than just delayed) due to replay buffer
   overflow, a new "subscription-started" must be sent.  This new
   "subscription-started" indicates an event record discontinuity.




Voit, et al.              Expires June 25, 2018                [Page 16]

Internet-Draft          Subscribed Notifications           December 2017


   To see an example at subscription creation using configuration
   operations over NETCONF, see Appendix A of
   [I-D.draft-ietf-netconf-netconf-event-notifications].

   Note that is possible to configure replay on a configured
   subscription.  This capability is to allow a configured subscription
   to exist on a system so that event records generated during boot can
   be buffered and pushed as soon as the transport session is
   established.

2.5.3.  Modifying a Configured Subscription

   Configured subscriptions can be modified using configuration
   operations against the top-level subtree "subscription-config".

   If the modification involves adding receivers, added receivers are
   placed in the "connecting" state.  If a receiver is removed, the
   state change notification "subscription-terminated" is sent to that
   receiver if that receiver is "active" or "suspended" .

   If the modification involved changing the policies for the
   subscription, the publisher sends to currently active receivers a
   "subscription-modified" notification.  For any suspended receivers, a
   "subscription-modified" notification will be delayed until the
   receiver is resumed.  (Note: in this case, the "subscription-
   modified" notification informs the receiver that the subscription has
   been resumed, so no additional "subscription-resumed" need be sent.)

2.5.4.  Deleting a Configured Subscription

   Subscriptions can be deleted using configuration operations against
   the top-level subtree "subscription-config".

   Immediately after a subscription is successfully deleted, the
   publisher sends to all receivers of that subscription a state change
   notification stating the subscription has ended (i.e., "subscription-
   terminated").

2.5.5.  Resetting a Configured Receiver

   It is possible that a configured subscription to a receiver needs to
   be reset.  This re-initialization may be useful in cases where a
   publisher has timed out trying to reach a receiver.  When such a
   reset occurs, a transport session will be initiated if necessary, and
   a new "subscription-started" notification will be sent.






Voit, et al.              Expires June 25, 2018                [Page 17]

Internet-Draft          Subscribed Notifications           December 2017


2.6.  Event Record Delivery

   Whether dynamic or configured, once a subscription has been set up,
   the publisher streams event records via notification messages per the
   terms of the subscription.  For dynamic subscriptions set up via RPC
   operations, notification messages are sent over the session used to
   establish the subscription.  For configured subscriptions,
   notification messages are sent over the connections specified by the
   transport, plus receiver IP address and port configured.

   A notification message is sent to a receiver when an event record is
   able to traverse the specified filter criteria.  This notification
   message MUST be encoded as one-way notification element of [RFC5277],
   Section 4.  The following example within [RFC7950] section 7.16.3 is
   an example of a compliant message:

      <notification
             xmlns="urn:ietf:params:xml:ns:netconf:notification:1.0">
          <eventTime>2007-09-01T10:00:00Z</eventTime>
          <link-failure xmlns="http://acme.example.com/system">
              <if-name>so-1/2/3.0</if-name>
              <if-admin-status>up</if-admin-status>
              <if-oper-status>down</if-oper-status>
          </link-failure>
      </notification>

                 Figure 4: subscribed notification message

   This [RFC5277] section 4 one-way operation has the drawback of not
   including useful header information such as a subscription
   identifier.  When using this mechanism, it is left up to
   implementations or augmentations to this document to determine which
   event records belong to which subscription.

   These drawbacks, along with other useful common headers and the
   ability to bundle multiple event records together is being explored
   within [I.D.draft-ietf-netconf-notification-messages].  When the
   notification-messages is supported, this document will be updated to
   indicate support.

2.7.  Subscription State Notifications

   In addition to subscribed event records, a publisher will send
   subscription state notifications to indicate to receivers that an
   event related to the subscription management has occurred.

   Subscription state notifications are unlike other notifications which
   might be found in the event stream.  They cannot be filtered out, and



Voit, et al.              Expires June 25, 2018                [Page 18]

Internet-Draft          Subscribed Notifications           December 2017


   they are delivered only to directly impacted receiver(s) of a
   subscription.  The identification of subscription state notifications
   is easy to separate from other notification messages through the use
   of the YANG extension "subscription-state-notif".  This extension
   tags a notification as subscription state notification.

   The complete set of subscription state notifications is described in
   the following subsections.

2.7.1.  subscription-started

   This notification indicates that a configured subscription has
   started, and event records may be sent.  Included in this state
   change notification are all the parameters of the subscription,
   except for the receiver(s) addressing information and origin
   information indicating where notification messages will egress the
   publisher.  Note that if a referenced filter from the "filters"
   container has been used within the subscription, the notification
   will include the contents of that referenced under the "within-
   subscription" subtree.

   Note that for dynamic subscriptions, no "subscription-started"
   notifications are ever sent.

+---n subscription-started {configured}?
   +--ro identifier               subscription-id
   +--ro protocol                 transport {configured}?
   +--ro encoding                 encoding
   +--ro (target)
   |  +--:(stream)
   |     +--ro (stream-filter)?
   |     |  +--:(by-reference)
   |     |  |  +--ro stream-filter-ref        stream-filter-ref
   |     |  +--:(within-subscription)
   |     |     +--ro (filter-spec)?
   |     |        +--:(stream-subtree-filter)
   |     |        |  +--ro stream-subtree-filter?    {subtree}?
   |     |        +--:(stream-xpath-filter)
   |     |           +--ro stream-xpath-filter?   yang:xpath1.0 {xpath}?
   |     +--ro stream                   stream
   |     +--ro replay-start-time?       yang:date-and-time {replay}?
   +--ro stop-time?               yang:date-and-time
   +--ro dscp?                    inet:dscp {qos}?
   +--ro weighting?               uint8 {qos}?
   +--ro dependency?              sn:subscription-id {qos}?

                Figure 5: subscription-started notification




Voit, et al.              Expires June 25, 2018                [Page 19]

Internet-Draft          Subscribed Notifications           December 2017


2.7.2.  subscription-modified

   This notification indicates that a subscription has been modified by
   configuration operations.  The same parameters of "subscription-
   started" are provided via this notification.  As a result, the tree
   structure of "subscription-modified" is almost identical to
   "subscription-started", with only the name of the notification
   changing.

   A publisher most often sends this notification directly after the
   modification of any configuration parameters impacting a configured
   subscription.  But it may also be sent at two other times.

   o  First, where a configured subscription has been modified during
      the suspension of a receiver, the notification will be delayed
      until the receiver's suspension is lifted.  In this situation, the
      notification indicates that the subscription has been both
      modified and resumed.

   o  Second, for dynamic subscriptions, there is one and only one time
      this notification may be sent.  A "subscription-modified" state
      change notifications MUST be sent if the contents of a filter
      identified by a "stream-filter-ref" has changed.

2.7.3.  subscription-terminated

   This notification indicates that a subscription has been terminated
   on the publisher.  The state change notification includes the reason
   for the termination.

   The publisher MAY decide to terminate a subscription rather than
   continuing to serve it.  Such a decision may be made when a publisher
   runs out of resources, an internal error occurs, or some other
   reason.  Publisher-driven terminations are always notified to all
   receivers.

   Subscribers themselves can terminate existing subscriptions
   established via a "delete-subscription" RPC.  In such cases, no
   "subscription-terminated" state change notifications are sent.
   However if a "kill-subscription" RPC is sent, or some other event
   other than reaching the subscription's stop time results in the end
   of a subscription, then this state change notification MUST be sent.









Voit, et al.              Expires June 25, 2018                [Page 20]

Internet-Draft          Subscribed Notifications           December 2017


       +---n subscription-terminated
          +--ro identifier        subscription-id
          +--ro error-id          subscription-errors
          +--ro filter-failure?   string

              Figure 6: subscription-terminated notification

2.7.4.  subscription-suspended

   This notification indicates that a publisher has suspended the
   sending of event records to a receiver, and also indicates the
   possible loss of events.  The state change notification includes the
   reason for the suspension.  No further notification will be sent
   until the subscription resumes.

   The tree structure of "subscription-suspended" is almost identical to
   "subscription-terminated", with only the name of the notification
   changing.

2.7.5.  subscription-resumed

   This indicates that a previously suspended subscription has been
   resumed under the unmodified terms previously in place.  Subscribed
   event records generated after the generation of this state change
   notification will be sent.

       +---n subscription-resumed
          +--ro identifier    subscription-id

                Figure 7: subscription-resumed notification

2.7.6.  subscription-completed

   This notification indicates that a subscription, which includes a
   "stop-time", has successfully finished passing event records upon the
   reaching of that time.

   The tree structure of "subscription-completed" is almost identical to
   "subscription-resumed", with only the name of the notification
   changing.

2.7.7.  replay-completed

   This notification indicates that all of the event records prior to
   the current time have been sent.  This includes new event records
   generated since the start of the subscription.  This notification
   MUST NOT be sent for any other reason.




Voit, et al.              Expires June 25, 2018                [Page 21]

Internet-Draft          Subscribed Notifications           December 2017


   If subscription contains no "stop-time", or has a "stop-time" which
   has not been reached, then after the "replay-completed" notification
   has been sent, additional event records will be sent in sequence as
   they arise naturally on the publisher.

   The tree structure of "replay-completed" is almost identical to
   "subscription-resumed", with only the name of the notification
   changing.

2.8.  Subscription Monitoring

   Container "subscriptions" in the YANG module contains the state of
   all known subscriptions.  This includes subscriptions that were
   established (and have not yet been deleted) using RPCs, as well as
   subscriptions that have been configured as part of configuration.
   Using the "get" operation with NETCONF, or subscribing to this
   information via [I-D.ietf-netconf-yang-push] allows the status of
   subscriptions to be monitored.

   Each subscription is represented as a list element.  The associated
   information includes an identifier for the subscription, receiver
   counter information, the status of the subscription, as well as the
   various subscription parameters that are in effect.  The subscription
   status indicates the subscription's state with each receiver (e.g.,
   is currently active or suspended).  Leaf "configured-subscription"
   indicates whether the subscription came into being via configuration
   or via RPC.

   Subscriptions that were established by RPC are removed from the list
   once they expire (reaching stop-time) or when they are terminated.
   Subscriptions that were established by configuration need to be
   deleted from the configuration by a configuration editing operation
   even if the stop time has been passed.

2.9.  Advertisement

   Publishers supporting this document MUST indicate support the YANG
   model "ietf-subscribed-notifications" within the YANG library of the
   publisher.  In addition support for optional features: "encode-xml",
   "encode-json", "configured" "supports-vrf", and "replay" MUST also be
   indicated if supported.

   If a publisher supports this specification but not subscriptions via
   [RFC5277], the publisher MUST NOT advertise
   "urn:ietf:params:netconf:capability:notification:1.0".  Even without
   this advertisement however, the publisher MUST support the one-way
   notification element of [RFC5277] Section 4.




Voit, et al.              Expires June 25, 2018                [Page 22]

Internet-Draft          Subscribed Notifications           December 2017


3.  YANG Data Model Trees

   This section contains tree diagrams for top level YANG Data Node
   containers defined in Section 4.  If you would rather see tree
   diagrams for Notifications, see Section 2.7.  Or for the tree
   diagrams for the RPCs, see Section 2.4.

3.1.  Event Streams Container

   A publisher maintains a list of available event streams as
   operational data.  This list contains both standardized and vendor-
   specific event streams.  The list of event streams that are supported
   by the publisher and against which subscription is allowed may be
   acquired from the "streams" container within the YANG module.

    +--rw streams
       +--rw stream* [name]
          +--rw name                        stream
          +--rw description                 string
          +--rw replay-support?             empty {replay}?
          +--rw replay-log-creation-time?   yang:date-and-time {replay}?
          +--rw replay-log-aged-time?       yang:date-and-time {replay}?

                        Figure 8: Stream Container

3.2.  Event Stream Filters Container

   The "filters" container maintains a list of all subscription filters
   which persist outside the life-cycle of a single subscription.  This
   enables pre-defined and validated filters which may be referenced and
   used by more than one subscription.

       +--rw filters
          +--rw stream-filter* [identifier]
             +--rw identifier               filter-id
             +--rw (filter-spec)?
                +--:(stream-subtree-filter)
                |  +--rw stream-subtree-filter?    {subtree}?
                +--:(stream-xpath-filter)
                   +--rw stream-xpath-filter?     yang:xpath1.0 {xpath}?

                        Figure 9: Filter Container

3.3.  Subscriptions Container

   The "subscriptions" container maintains a list of all subscriptions
   on a publisher, both configured and dynamic.  It can be used to




Voit, et al.              Expires June 25, 2018                [Page 23]

Internet-Draft          Subscribed Notifications           December 2017


   retrieve information about the subscriptions which a publisher is
   serving.


  +--ro subscriptions
     +--ro subscription* [identifier]
        +--ro identifier                       subscription-id
        +--ro configured-subscription-state?   enumeration {configured}?
        +--ro purpose?                         string {configured}?
        +--ro protocol                         transport {configured}?
        +--ro encoding                         encoding
        +--ro (target)
        |  +--:(stream)
        |     +--ro (stream-filter)?
        |     |  +--:(by-reference)
        |     |  |  +--ro stream-filter-ref          stream-filter-ref
        |     |  +--:(within-subscription)
        |     |     +--ro (filter-spec)?
        |     |        +--:(stream-subtree-filter)
        |     |        |  +--ro stream-subtree-filter?      {subtree}?
        |     |        +--:(stream-xpath-filter)
        |     |           +--ro stream-xpath-filter?
        |     |                                yang:xpath1.0 {xpath}?
        |     +--ro stream?                    stream-ref
        |     +--ro replay-start-time?    yang:date-and-time {replay}?
        +--ro stop-time?                     yang:date-and-time
        +--ro dscp?                          inet:dscp {qos}?
        +--ro weighting?                     uint8 {qos}?
        +--ro dependency?                    sn:subscription-id {qos}?
        +--ro (notification-message-origin)?
        |  +--:(interface-originated)
        |  |  +--ro source-interface?                if:interface-ref
        |  +--:(address-originated)
        |     +--ro source-vrf?                      ->
        |  /ni:network-instances/network-instance/name {supports-vrf}?
        |     +--ro source-address?            inet:ip-address-no-zone
        +--ro receivers
           +--ro receiver* [address port]
              +--ro address                   inet:host
              +--ro port                      inet:port-number
              +--ro pushed-notifications?     yang:counter64
              +--ro excluded-notifications?   yang:counter64
              +--ro status                    enumeration
              +---x reset
                 +--ro output
                    +--ro time    yang:date-and-time





Voit, et al.              Expires June 25, 2018                [Page 24]

Internet-Draft          Subscribed Notifications           December 2017


3.4.  Subscription-config Container

   "Subscription-config" container contains the configuration of
   configured subscriptions.

+--rw subscription-config {configured}?
  +--rw subscription* [identifier]
     +--rw identifier               subscription-id
     +--rw purpose?                 string
     +--rw protocol                 transport {configured}?
     +--rw encoding                 encoding
     +--rw (target)
     |  +--:(stream)
     |     +--rw (stream-filter)?
     |     |  +--:(by-reference)
     |     |  |  +--rw stream-filter-ref        stream-filter-ref
     |     |  +--:(within-subscription)
     |     |     +--rw (filter-spec)?
     |     |        +--:(stream-subtree-filter)
     |     |        |  +--rw stream-subtree-filter?    {subtree}?
     |     |        +--:(stream-xpath-filter)
     |     |           +--rw stream-xpath-filter? yang:xpath1.0 {xpath}?
     |     +--rw stream?                  stream-filter-ref
     |     +--rw replay-start-time?       yang:date-and-time {replay}?
     +--rw stop-time?               yang:date-and-time
     +--rw dscp?                    inet:dscp {qos}?
     +--rw weighting?               uint8 {qos}?
     +--rw dependency?              sn:subscription-id {qos}?
     +--rw (notification-message-origin)?
     |  +--:(interface-originated)
     |  |  +--rw source-interface?        if:interface-ref
     |  +--:(address-originated)
     |     +--rw source-vrf?              ->
     |     | /ni:network-instances/network-instance/name {supports-vrf}?
     |     +--rw source-address?          inet:ip-address-no-zone
     +--rw receivers
        +--rw receiver* [address port]
           +--rw address    inet:host
           +--rw port       inet:port-number

4.  Data Model

<CODE BEGINS> file "ietf-subscribed-notifications.yang"
module ietf-subscribed-notifications {
  yang-version 1.1;
  namespace
    "urn:ietf:params:xml:ns:yang:ietf-subscribed-notifications";




Voit, et al.              Expires June 25, 2018                [Page 25]

Internet-Draft          Subscribed Notifications           December 2017


  prefix sn;

  import ietf-yang-types {
    prefix yang;
  }
  import ietf-inet-types {
    prefix inet;
  }
  import ietf-interfaces {
    prefix if;
  }
  import ietf-network-instance {
    prefix ni;
  }

  organization "IETF";
  contact
    "WG Web:   <http:/tools.ietf.org/wg/netconf/>
     WG List:  <mailto:netconf@ietf.org>

     Editor:   Alexander Clemm
               <mailto:ludwig@clemm.org>

     Editor:   Eric Voit
               <mailto:evoit@cisco.com>

     Editor:   Alberto Gonzalez Prieto
               <mailto:agonzalezpri@vmware.com>

     Editor:   Einar Nilsen-Nygaard
               <mailto:einarnn@cisco.com>

     Editor:   Ambika Prasad Tripathy
               <mailto:ambtripa@cisco.com>";

  description
    "Contains a YANG specification for subscribing to event records
    and receiving matching content within notification messages.";

  revision 2017-12-20 {
    description
      "Initial version";
    reference
      "draft-ietf-netconf-subscribed-notifications-08";
  }

  /*
   * FEATURES



Voit, et al.              Expires June 25, 2018                [Page 26]

Internet-Draft          Subscribed Notifications           December 2017


   */

  feature encode-json {
    description
      "This feature indicates that JSON encoding of notification
       messages is supported.";
  }

  feature encode-xml {
    description
      "This feature indicates that XML encoding of notification
       messages is supported.";
  }

  feature configured {
    description
      "This feature indicates that configuration of subscription is
      supported.";
  }

  feature replay {
    description
      "This feature indicates that historical event record replay is
      supported.  With replay, it is possible for past event records to
      be streamed in chronological order.";
  }

  feature xpath {
    description
      "This feature indicates support for xpath filtering.";
    reference "http://www.w3.org/TR/1999/REC-xpath-19991116";
  }

  feature subtree {
    description
      "This feature indicates support for YANG subtree filtering.";
    reference "RFC 6241, Section 6.";
  }

  feature supports-vrf {
    description
      "This feature indicates a publisher supports VRF configuration
      for configured subscriptions.  VRF support for dynamic
      subscriptions does not require this feature.";
    reference "draft-ietf-rtgwg-ni-model";
  }

  feature qos {



Voit, et al.              Expires June 25, 2018                [Page 27]

Internet-Draft          Subscribed Notifications           December 2017


    description
      "This feature indicates a publisher supports one or more optional
      Quality of Service (QoS) features to differentiate update record
      treatment between publisher and receiver.";
  }

  /*
   * EXTENSIONS
   */

  extension subscription-state-notification {
    description
      "This statement applies only to notifications. It indicates that
       the notification is a subscription state notification. Therefore
       it does not participate in a regular event stream and does not
       need to be specifically subscribed to in order to be received.
       This statement can only occur as a substatement to the YANG
       'notification' statement.";
  }

  /*
   * IDENTITIES
   */

  /* Identities for subscription results */
  identity subscription-result {
    description
      "Base identity for RPC responses and State Change Notifications
      providing information on the creation, modification, deletion of
       subscriptions.";
  }

  identity ok {
    base subscription-result;
    description
      "OK - RPC was successful and was performed as requested.";
  }

  identity error {
    base subscription-result;
    description
      "Problem with subscription.  Base identity for error return
      codes for RPCs and State Change Notifications.";
  }

  /* Identities for subscription errors */

  identity suspension-timeout {



Voit, et al.              Expires June 25, 2018                [Page 28]

Internet-Draft          Subscribed Notifications           December 2017


    base error;
    description
     "Termination of previously suspended subscription. The publisher
      has eliminated the subscription as it exceeded a time limit for
      suspension.";
  }

  identity stream-unavailable {
    base error;
    description
     "Stream does not exist or is not available to the receiver.";
  }

  identity encoding-unavailable {
    base error;
    description
     "Encoding not supported";
  }

  identity replay-unsupported {
    base error;
    description
     "Replay cannot be performed for this subscription. The publisher
     does not provide the requested historic information via replay.";
  }

  identity history-unavailable {
    base error;
    description
     "Replay request too far into the past. The publisher does store
      historic information for all parts of requested subscription, but
      not back to the requested timestamp.";
  }

  identity filter-unavailable {
    base error;
    description
     "Referenced filter does not exist";
  }

  identity filter-type-unsupported {
    base error;
    description
     "Publisher does not support filters constructed using this
     filtering technology syntax.";
  }

  identity filter-unsupported {



Voit, et al.              Expires June 25, 2018                [Page 29]

Internet-Draft          Subscribed Notifications           December 2017


    base error;
    description
     "Failure can be from a syntax error, or a syntax too complex to be
     processed by the platform. The supplemental info should include
     the invalid part of the filter.";
  }

  identity namespace-unavailable {
    base error;
    description
     "Referenced namespace doesn't exist or is unavailable
      to the receiver.";
  }

  identity no-such-subscription {
    base error;
    description
     "Referenced subscription doesn't exist. This may be as a result of
      a non-existent subscription ID, an ID which belongs to another
      subscriber, or an ID for acceptable subscription which has been
      statically configured.";
  }

  identity insufficient-resources {
    base error;
    description
      "The publisher has insufficient resources to support the
       subscription as requested by an RPC.";
  }

  identity unsupportable-volume {
    base error;
    description
      "The publisher cannot support the volume of information intended
      to be sent for an existing subscription.";
  }

  identity error-no-such-option {
    base error;
    description
      "A requested parameter setting is not supported.";
  }

  identity dscp-unavailable {
    base sn:error;
    description
      "Requested DSCP marking not allocatable.";
  }



Voit, et al.              Expires June 25, 2018                [Page 30]

Internet-Draft          Subscribed Notifications           December 2017


  identity qos-unsupported {
    base sn:error;
    description
      "An included subscription QoS parameter or parameter value is not
      supported by the publisher.";
  }

  /* Identities for encodings */
  identity encodings {
    description
      "Base identity to represent data encodings";
  }

  identity encode-xml {
    base encodings;
    if-feature "encode-xml";
    description
      "Encode data using XML";
  }

  identity encode-json {
    base encodings;
    if-feature "encode-json";
    description
      "Encode data using JSON";
  }

  /* Identities for transports */
  identity transport {
    description
      "An identity that represents a the underlying mechanism for
      passing notification messages.";
  }

  identity netconf {
    base transport;
    description
      "Netconf is used a transport for notification messages and state
       change notifications.";
    reference "draft-ietf-netconf-netconf-event-notifications";
  }

  identity http2 {
    base transport;
    description
      "HTTP2 is used a transport for notification messages and state
       change notifications.";
    reference "draft-ietf-netconf-restconf-notif-03, Sections 3.1.1" +



Voit, et al.              Expires June 25, 2018                [Page 31]

Internet-Draft          Subscribed Notifications           December 2017


      "3.1.3";
  }

  identity http1.1 {
    base transport;
    description
      "HTTP1.1 is used a transport for notification messages and state
       change notifications.";
    reference "draft-ietf-netconf-restconf-notif-03, Section 3.1.2";
  }
  /*
   * TYPEDEFs
   */

  typedef subscription-id {
    type uint32;
    description
      "A type for subscription identifiers.";
  }

  typedef filter-id {
    type string;
    description
      "A type to identify filters which can be associated with a
       subscription.";
  }

  typedef subscription-result {
    type identityref {
      base subscription-result;
    }
    description
      "The result of a subscription operation";
  }

  typedef subscription-errors {
    type identityref {
      base error;
    }
    description
      "The reason for the failure of an RPC request or the sending
       of a subscription suspension or termination state change
       notification";
  }

  typedef encoding {
    type identityref {
      base encodings;



Voit, et al.              Expires June 25, 2018                [Page 32]

Internet-Draft          Subscribed Notifications           December 2017


    }
    description
      "Specifies a data encoding, e.g. for a data subscription.";
  }

  typedef transport {
    type identityref {
      base transport;
    }
    description
      "Specifies protocol used to send notification messages to a
       receiver.";
  }

  typedef stream-ref {
    type leafref {
      path "/sn:streams/sn:stream/sn:name";
    }
    description
      "This type is used to reference a system-provided datastream.";
  }

  typedef stream-filter-ref {
    type leafref {
      path "/sn:filters/sn:stream-filter/sn:identifier";
    }
    description
      "This type is used to reference a configured stream filter.";
  }

  /*
   * GROUPINGS
   */

  grouping stream-filter-elements {
    description
      "This grouping defines the base for filters applied to event
       streams.";
    choice filter-spec {
      description
        "The content filter specification for this request.";
      anydata stream-subtree-filter {
        if-feature "subtree";
        description
          "Event stream evaluation criteria encoded in the syntax of a
          subtree filter as defined in RFC 6241, Section 6.

          The subtree filter is applied to the representation of



Voit, et al.              Expires June 25, 2018                [Page 33]

Internet-Draft          Subscribed Notifications           December 2017


          individual, delineated event records as contained within the
          event stream.  For example, if the notification message
          contains an instance of a notification defined in YANG, then
          the top-level element is the name of the YANG notification.

          If the subtree filter returns a non-empty node set, the filter
          matches the event record, and the it is included in the
          notification message sent to the receivers.";
        reference "RFC 6241, Section 6.";
      }
      leaf stream-xpath-filter {
        if-feature "xpath";
        type yang:xpath1.0;
        description
          "Event stream evaluation criteria encoded in the syntax of
           an XPath 1.0 expression.

           The XPath expression is evaluated on the representation of
           individual, delineated event records as contained within
           the event stream.  For example, if the notification message
           contains an instance of a notification defined in YANG,
           then the top-level element is the name of the YANG
           notification, and the root node has this top-level element
           as the only child.

           The result of the XPath expression is converted to a
           boolean value using the standard XPath 1.0 rules.  If the
           boolean value is 'true', the filter matches the the event
           record, and the it is included in the notification message
           sent to the receivers.

           The expression is evaluated in the following XPath context:

             o  The set of namespace declarations are those in scope on
                the 'xpath-filter' leaf element

             o  The set of variable bindings is empty.

             o  The function library is the core function library, and
                the XPath functions defined in section 10 in RFC 7950.

             o  The context node is the root node.";
        reference
          "http://www.w3.org/TR/1999/REC-xpath-19991116
           RFC 7950, Section 10.";

      }
    }



Voit, et al.              Expires June 25, 2018                [Page 34]

Internet-Draft          Subscribed Notifications           December 2017


  }

  grouping update-qos {
    description
      "This grouping describes Quality of Service information
       concerning a subscription.  This information is passed to lower
       layers for transport prioritization and treatment";
    leaf dscp {
      if-feature "qos";
      type inet:dscp;
      default "0";
      description
        "The push update's IP packet transport priority. This is made
         visible across network hops to receiver. The transport
         priority is shared for all receivers of a given subscription.";
    }
    leaf weighting {
      if-feature "qos";
      type uint8 {
         range "0 .. 255";
      }
      description
        "Relative weighting for a subscription. Allows an underlying
         transport layer perform informed load balance allocations
         between various subscriptions";
      reference
        "RFC-7540, section 5.3.2";
    }
    leaf dependency {
      if-feature "qos";
      type sn:subscription-id;
      description
        "Provides the Subscription ID of a parent subscription which
         has absolute priority should that parent have push updates
         ready to egress the publisher. In other words, there should be
         no streaming of objects from the current subscription if
         the parent has something ready to push.";
      reference
        "RFC-7540, section 5.3.1";
    }
  }

  grouping subscription-policy-modifiable {
    description
      "This grouping describes all objects which may be changed
      in a subscription via an RPC.";
    choice target {
      mandatory true;



Voit, et al.              Expires June 25, 2018                [Page 35]

Internet-Draft          Subscribed Notifications           December 2017


      description
        "Identifies the source of information against which a
        subscription is being applied, as well as specifics on the
        subset of information desired from that source.  This choice
        exists so that additional filter types can be added via
        augmentation.";
      case stream {
        choice stream-filter {
          description
            "An event stream filter can be applied to a subscription.
            That filter will come either referenced from a global list,
            or be provided within the subscription itself.";
          case by-reference {
            description
              "Apply a filter that has been configured separately.";
            leaf stream-filter-ref {
              type stream-filter-ref;
              mandatory true;
              description
                "References an existing stream-filter which is to
                be applied to stream for the subscription.";
            }
          }
          case within-subscription {
            description
              "Local definition allows a filter to have the same
              lifecycle as the subscription.";
            uses stream-filter-elements;
          }
        }
      }
    }
    leaf stop-time {
      type yang:date-and-time;
      description
        "Identifies a time after which notification messages for a
        subscription should not be sent.  If stop-time is not present,
        the notification messages will continue until the subscription
        is terminated.  If replay-start-time exists, stop-time must be
        for a subsequent time. If replay-start-time doesn't exist,
        stop-time must be for a future time.";
    }
  }

  grouping subscription-policy-dynamic {
    description
      "This grouping describes information concerning a subscription
      which can be passed over the RPCs defined in this model.";



Voit, et al.              Expires June 25, 2018                [Page 36]

Internet-Draft          Subscribed Notifications           December 2017


    leaf encoding {
      type encoding;
      mandatory true;
      description
        "The type of encoding for the subscribed data.";
    }
    uses subscription-policy-modifiable {
      augment target/stream {
        description
          "Adds additional objects which must be set just by RPC.";
        leaf stream {
          type stream-ref {
            require-instance false;
          }
          description
            "Indicates a stream of event records against which to apply
            a stream filter.  Require-instance is false in case a
            configured subscription reference a stream which is
            dynamically generated and only available at runtime.";
        }
        leaf replay-start-time {
          if-feature "replay";
          type yang:date-and-time;
          description
            "Used to trigger the replay feature and indicate that the
            replay should start at the time specified.  If
            replay-start-time is not present, this is not a replay
            subscription and event record push should start immediately.
            It is never valid to specify start times that are later than
            or equal to the current time.";
        }
      }
    }
    uses update-qos;
  }

  grouping subscription-policy {
    description
      "This grouping describes the full set of policy information
      concerning both dynamic and configured subscriptions, except for
      configured receivers.";
    leaf protocol {
      if-feature "configured";
      type transport;
      mandatory true;
      description
        "This leaf specifies the transport protocol used to deliver
        messages destined to all receivers of a subscription.";



Voit, et al.              Expires June 25, 2018                [Page 37]

Internet-Draft          Subscribed Notifications           December 2017


    }
    uses subscription-policy-dynamic;
  }

  grouping notification-origin-info {
    description
      "Defines the sender source from which notification messages for a
       configured subscription are sent.";
    choice notification-message-origin {
      description
        "Identifies the egress interface on the Publisher from which
         notification messages are to be sent.";
      case interface-originated {
        description
          "When notification messages to egress a specific, designated
           interface on the Publisher.";
        leaf source-interface {
          type if:interface-ref;
          description
            "References the interface for notification messages.";
        }
      }
      case address-originated {
        description
          "When notification messages are to depart from a publisher
             using specfic originating address and/or routing context
           information.";
        leaf source-vrf {
          if-feature "supports-vrf";
          type leafref {
            path "/ni:network-instances/ni:network-instance/ni:name";
          }
          description
            "VRF from which notification messages should egress a
            publisher.";
        }
        leaf source-address {
          type inet:ip-address-no-zone;
          description
            "The source address for the notification messages.  If a
            source VRF exists, but this object doesn't, a publisher's
            default address for that VRF must be used.";
        }
      }
    }
  }

  grouping receiver-info {



Voit, et al.              Expires June 25, 2018                [Page 38]

Internet-Draft          Subscribed Notifications           December 2017


    description
      "Defines where and how to get notification messages for a
      configured subscriptions to one or more targeted recipient.  This
      includes specifying the destination addressing as well as a
      transport protocol acceptable to the receiver.";
    container receivers {
      description
        "Set of receivers in a subscription.";
      list receiver {
        key "address port";
        min-elements 1;
        description
          "A single host or multipoint address intended as a target
           for the notification messages of a subscription.";
        leaf address {
          type inet:host;
          description
            "Specifies the address for the traffic to reach a remote
            host. One of the following must be specified: an ipv4
            address, an ipv6 address, or a host name.";
        }
        leaf port {
          type inet:port-number;
          description
            "This leaf specifies the port number to use for messages
             destined for a receiver.";
        }
      }
    }
  }

  grouping error-identifier {
    description
      "A code passed back within an RPC response to describe why the RFC
       has failed, or within a state change notification to describe why
       the change has occurred.";
    leaf error-id {
      type subscription-errors;
      mandatory true;
      description
        "Identifies the subscription error condition.";
    }
  }

  grouping hints {
    description
      "Objects passed back within an RPC response to describe why the
       RFC has failed, or within a state change notification to



Voit, et al.              Expires June 25, 2018                [Page 39]

Internet-Draft          Subscribed Notifications           December 2017


       describe why the change has occurred.";
    leaf filter-failure {
      type string;
      description
        "Information describing where and/or why a provided filter was
        unsupportable for a subscription.";
    }
  }

  grouping subscription-response-with-hints {
    description
      "Defines the output for the establish-subscription and
       modify-subscription RPCs.";
    leaf subscription-result {
      type subscription-result;
      mandatory true;
      description
        "Indicates whether subscription is operational, or if a problem
         was encountered.";
    }
    choice result {
      description
        "Depending on the subscription result, different data is
         returned.";
      case no-success {
        description
          "This case applies when a subscription request was not
           successful and no subscription was created (or modified) as a
           result.  In this case, information MAY be returned that
           indicates suggested parameter settings that would have a
           high likelihood of succeeding in a subsequent establish-
           subscription or modify-subscription request.";
        uses hints;
      }
    }
  }

  /*
   * RPCs
   */

  rpc establish-subscription {
    description
      "This RPC allows a subscriber to create (and possibly negotiate)
       a subscription on its own behalf.  If successful, the
       subscription remains in effect for the duration of the
       subscriber's association with the publisher, or until the
       subscription is terminated. In case an error (as indicated by



Voit, et al.              Expires June 25, 2018                [Page 40]

Internet-Draft          Subscribed Notifications           December 2017


       subscription-result) is returned, the subscription is not
       created.  In that case, the RPC reply MAY include suggested
       parameter settings that would have a higher likelihood of
       succeeding in a subsequent establish-subscription request.";
    input {
      uses subscription-policy-dynamic {
        refine "encoding" {
          mandatory false;
          description
            "The type of encoding for the subscribed data. If not
            included as part of the RPC, the encoding MUST be set by the
            publisher to be the encoding used by this RPC.";
        }
      }
    }
    output {
      uses subscription-response-with-hints  {
        augment "result" {
          description
            "Allows information to be passed back as part of a
             successful subscription establishment.";
          case success {
            description
              "This case is used when the subscription request was
               successful.";
            leaf identifier {
              type subscription-id;
              mandatory true;
              description
                "Identifier used for this subscription.";
            }
          }
        }
        augment "result/no-success" {
          description
            "Contains establish RPC specific objects which can be
             returned as hints for future attempts.";
          leaf replay-start-time-hint {
            type yang:date-and-time;
            description
              "If a replay has been requested, but the requested replay
              time cannot be honored, this may provide a hint at an
              alternate time which may be supportable.";
          }
        }
      }
    }
  }



Voit, et al.              Expires June 25, 2018                [Page 41]

Internet-Draft          Subscribed Notifications           December 2017


  rpc modify-subscription {
    description
      "This RPC allows a subscriber to modify a subscription that was
       previously created using establish-subscription.  If successful,
       the changed subscription remains in effect for the duration of
       the subscriber's association with the publisher, or until the
       subscription is again modified or terminated.  In case an error
       is returned (as indicated by subscription-result), the
       subscription is not modified and the original subscription
       parameters remain in effect.  In that case, the rpc error
       response MAY include suggested parameter hints that would have
       a high likelihood of succeeding in a subsequent
       modify-subscription request.  A successful modifiy-subscription
       will return a suspended subscription to an active state.";
    input {
      leaf identifier {
        type subscription-id;
        description
          "Identifier to use for this subscription.";
      }
      uses subscription-policy-modifiable;
    }
    output {
      uses subscription-response-with-hints;
    }
  }

  rpc delete-subscription {
    description
      "This RPC allows a subscriber to delete a subscription that
       was previously created from by that same subscriber using the
       establish-subscription RPC.";
    input {
      leaf identifier {
        type subscription-id;
        mandatory true;
        description
          "Identifier of the subscription that is to be deleted.
           Only subscriptions that were created using
           establish-subscription can be deleted via this RPC.";
      }
    }
    output {
      leaf subscription-result {
        type subscription-result;
        mandatory true;
        description
          "Indicates whether subscription has been deleted, or if a



Voit, et al.              Expires June 25, 2018                [Page 42]

Internet-Draft          Subscribed Notifications           December 2017


          problem was encountered.";
      }
    }
  }

  rpc kill-subscription {
    description
      "This RPC allows an operator to delete a dynamic subscription
      without restrictions on the originating subscriber or underlying
      transport session.";
    input {
      leaf identifier {
        type subscription-id;
        mandatory true;
        description
          "Identifier of the subscription that is to be deleted. Only
            subscriptions that were created using establish-subscription
           can be deleted via this RPC.";
      }
    }
    output {
      leaf subscription-result {
        type subscription-result;
        mandatory true;
        description
          "Indicates whether subscription has been killed, or if a
           problem was encountered.";
      }
    }
  }

  /*
   * NOTIFICATIONS
   */

  notification replay-completed {
    sn:subscription-state-notification;
    if-feature "replay";
    description
      "This notification is sent to indicate that all of the replay
        notifications have been sent. It must not be sent for any other
       reason.";
    leaf identifier {
      type subscription-id;
      mandatory true;
      description
        "This references the affected subscription.";
    }



Voit, et al.              Expires June 25, 2018                [Page 43]

Internet-Draft          Subscribed Notifications           December 2017


  }

  notification subscription-completed {
    sn:subscription-state-notification;
    description
      "This notification is sent to indicate that a subscription has
       finished passing event records.";
    leaf identifier {
      type subscription-id;
      mandatory true;
      description
        "This references the gracefully completed subscription.";
    }
  }

  notification subscription-started {
    sn:subscription-state-notification;
    if-feature "configured";
    description
      "This notification indicates that a subscription has started and
        notifications are beginning to be sent. This notification shall
       only be sent to receivers of a subscription; it does not
       constitute a general-purpose notification.";
    leaf identifier {
      type subscription-id;
      mandatory true;
      description
        "This references the affected subscription.";
    }
    uses subscription-policy {
      refine "target/stream/replay-start-time" {
         description
           "Indicates the time that a replay using for the streaming of
           buffered event records.  This will be populated with the most
           recent of the following: replay-log-creation-time,
           replay-log-aged-time, replay-start-time, or the most recent
           publisher boot time.";
      }
      refine "target/stream/stream-filter/within-subscription" {
        description
          "Filter applied to the subscription.  If the
          'stream-filter-ref' is populated, the filter within the
          subscription came from the 'filters' container.  Otherwise it
          is populated in-line as part of the subscription.";
      }
    }
  }




Voit, et al.              Expires June 25, 2018                [Page 44]

Internet-Draft          Subscribed Notifications           December 2017


  notification subscription-resumed {
    sn:subscription-state-notification;
    description
      "This notification indicates that a subscription that had
       previously been suspended has resumed. Notifications will once
       again be sent.  In addition, a subscription-resumed indicates
       that no modification of parameters has occured since the last
       time event records have been sent.";
    leaf identifier {
      type subscription-id;
      mandatory true;
      description
        "This references the affected subscription.";
    }
  }

  notification subscription-modified {
    sn:subscription-state-notification;
    description
      "This notification indicates that a subscription has been
       modified.  Notification messages sent from this point on will
       conform to the modified terms of the subscription.  For
       completeness, this state change notification includes both
       modified and non-modified aspects of a subscription.";
    leaf identifier {
      type subscription-id;
      mandatory true;
      description
        "This references the affected subscription.";
    }
    uses subscription-policy {
      refine "target/stream/stream-filter/within-subscription" {
        description
          "Filter applied to the subscription.  If the
          'stream-filter-ref' is populated, the filter within the
          subscription came from the 'filters' container.  Otherwise it
          is populated in-line as part of the subscription.";
      }
    }
  }

  notification subscription-terminated {
    sn:subscription-state-notification;
    description
      "This notification indicates that a subscription has been
       terminated.";
    leaf identifier {
      type subscription-id;



Voit, et al.              Expires June 25, 2018                [Page 45]

Internet-Draft          Subscribed Notifications           December 2017


      mandatory true;
      description
        "This references the affected subscription.";
    }
    uses error-identifier;
    uses hints;
  }

  notification subscription-suspended {
    sn:subscription-state-notification;
    description
      "This notification indicates that a suspension of the
       subscription by the publisher has occurred.  No further
       notifications will be sent until the subscription resumes.
       This notification shall only be sent to receivers of a
       subscription; it does not constitute a general-purpose
       notification.";
    leaf identifier {
      type subscription-id;
      mandatory true;
      description
        "This references the affected subscription.";
    }
    uses error-identifier;
    uses hints;
  }

  /*
   * DATA NODES
   */

  container streams {
    description
      "This container contains information on the built-in streams
      provided by the publisher.";
    list stream {
      key "name";
      description
        "Identifies the built-in streams that are supported by the
         publisher.";
      leaf name {
        type string;
        description
          "A handle for a system-provided datastream made up of a
          sequential set of event records, each of which is
          characterized by its own domain and semantics.";
      }
      leaf description {



Voit, et al.              Expires June 25, 2018                [Page 46]

Internet-Draft          Subscribed Notifications           December 2017


        type string;
        mandatory true;
        description
          "A description of the event stream, including such information
           as the type of event records that are available within this
           stream.";
      }
      leaf replay-support {
        if-feature "replay";
        type empty;
        description
          "Indicates that event record replay is available on this
          stream.";
      }
      leaf replay-log-creation-time {
        if-feature "replay";
        type yang:date-and-time;
        description
          "The timestamp of the creation of the log used to support the
          replay function on this stream. Note that this might be
          earlier then the earliest available information contained in
          the log. This object is updated if the log resets for some
          reason. This object MUST be present if replay is supported.";
      }
      leaf replay-log-aged-time {
        if-feature "replay";
        type yang:date-and-time;
        description
          "The timestamp of the last event record aged out of the log.
          This object MUST be present if replay is supported and any
          event record have been aged out of the log.";
      }
    }
  }

  container filters {
    description
      "This container contains a list of configurable filters
       that can be applied to subscriptions.  This facilitates
       the reuse of complex filters once defined.";
    list stream-filter {
      key "identifier";
      description
        "A list of pre-positioned filters that can be applied to
        subscriptions.";
      leaf identifier {
        type filter-id;
        description



Voit, et al.              Expires June 25, 2018                [Page 47]

Internet-Draft          Subscribed Notifications           December 2017


          "An identifier to differentiate between filters.";
      }
      uses stream-filter-elements;
    }
  }

  container subscription-config {
    if-feature "configured";
    description
      "Contains the list of subscriptions that are configured,
       as opposed to established via RPC or other means.";
    list subscription {
      key "identifier";
      description
        "The identity and specific parameters of a configured
        subscription.";
      leaf identifier {
        type subscription-id;
        description
          "Identifier to use for this subscription.  Should only
          use the bottom half of the identifier's integer range.";
      }
      leaf purpose {
        type string;
        description
          "Open text allowing a configuring entity to embed the
          originator or other specifics of this subscription.";
      }
      uses subscription-policy;
      uses notification-origin-info;
      uses receiver-info;
    }
  }
  container subscriptions {
    config false;
    description
      "Contains the list of currently active subscriptions, i.e.
       subscriptions that are currently in effect, used for subscription
       management and monitoring purposes. This includes subscriptions
       that have been setup via RPC primitives as well as subscriptions
       that have been established via configuration.";
    list subscription {
      key "identifier";
      description
        "The identity and specific parameterst of a subscription.
         Subscriptions within this list can be created using a control
         channel or RPC, or be established through configuration.";
      leaf identifier {



Voit, et al.              Expires June 25, 2018                [Page 48]

Internet-Draft          Subscribed Notifications           December 2017


        type subscription-id;
        description
          "Identifier of a subscription; unique within a publisher";
      }
      leaf configured-subscription-state {
        if-feature "configured";
        type enumeration {
          enum valid {
            value 1;
            description
              "Connection is active and healthy.";
          }
          enum invalid {
            value 2;
            description
              "The subscription as as whole is unsupportable with its
              current parameters.";
          }
          enum concluded {
            value 3;
              description
                "A subscription is inactive as it has hit a stop time,
                but not yet been removed from configuration.";
          }
        }
        description
          "The presence of this leaf indicates that the subscription
          originated from configuration, not through a control channel
          or RPC.  The value indicates the system established status
          of the subscription.";
      }
      leaf purpose {
        if-feature "configured";
        type string;
        description
          "Open text allowing a configuring entity to embed the
          originator or other specifics of this subscription.";
      }
      uses subscription-policy;
      uses notification-origin-info {
        if-feature "configured";
      }
      uses receiver-info {
        augment receivers/receiver {
          description
            "include operational data for receivers.";
          leaf pushed-notifications {
            type yang:counter64;



Voit, et al.              Expires June 25, 2018                [Page 49]

Internet-Draft          Subscribed Notifications           December 2017


            description
              "Operational data which provides the number of update
               notification messages pushed to a receiver.";
            }
          leaf excluded-notifications {
            type yang:counter64;
            description
              "Operational data which provides the number of event
               records from a stream explicitly removed via filtering so
               that they are not sent to a receiver.";
            }
          leaf status {
            type enumeration {
              enum active {
                value 1;
                description
                  "Receiver is currently being sent any applicable
                  notification messages for the subscription.";
              }
              enum suspended {
                value 2;
                description
                  "Receiver status is suspended, so the publisher
                  is currently unable to provide notification messages
                  for the subscription.";
              }
              enum connecting {
                value 3;
                if-feature "configured";
                description
                  "A subscription has been configured, but a
                  subscription-started state change notification needs
                  to be successfully received before notification
                  messages are sent.";
              }
              enum timeout {
                value 4;
                if-feature "configured";
                description
                  "A subscription has failed in sending a subscription
                  started state change to the receiver.
                  Additional attempts at connection attempts are not
                  currently being made.";
              }
            }
            mandatory true;
            description
              "Specifies the status of a subscription from the



Voit, et al.              Expires June 25, 2018                [Page 50]

Internet-Draft          Subscribed Notifications           December 2017


              perspective of a particular receiver.  With this info it
              is possible to determine whether a subscriber is currently
              generating notification messages intended for that
              receiver.";
          }
          action reset {
            description
              "Allows the reset of this configured subscription receiver
              to the 'connecting' state. This enables the
              connection process to be reinitiated.";
            output {
              leaf time {
                type yang:date-and-time;
                mandatory true;
                description
                  "Time a publisher returned the receiver to a
                  connecting status.";
              }
            }
          }
        }
      }
    }
  }
}
<CODE ENDS>

5.  Considerations

5.1.  Implementation Considerations

   For a deployment including both configured and dynamic subscriptions,
   split subscription identifiers into static and dynamic halves.  That
   way it is unlikely there will be collisions if the configured
   subscriptions attempt to set a subscription-id which might have
   already been dynamically allocated.  The lower half the "identifier"
   object in the subscriptions container SHOULD be used when the
   "identifier" is selected and assigned by an external entity (such as
   with a configured subscription).  And the upper half SHOULD be used
   for subscription identifiers dynamically chosen and assigned by the
   publisher

   Neither state change notification nor subscribed event records within
   notification messages may be sent before the transport layer,
   including any required capabilities exchange, has been established.

   An implementation may choose to transition between active and
   suspended subscription states more frequently than required by this



Voit, et al.              Expires June 25, 2018                [Page 51]

Internet-Draft          Subscribed Notifications           December 2017


   specification.  However if a subscription is unable to marshal all
   intended updates into a transmittable message in multiple successive
   intervals, the subscription SHOULD be suspended with the reason
   "unsupportable-volume".

   For configured subscriptions, operations are against the set of
   receivers using the subscription identifier as a handle for that set.
   But for streaming up dates, state change notifications are local to a
   receiver.  In this specification it is the case that receivers get no
   information from the publisher about the existence of other
   receivers.  But if an operator wants to let the receivers correlate
   results, it is useful to use the subscription identifier handle
   across the receivers to allow that correlation.

5.2.  IANA Considerations

   This document registers the following namespace URI in the "IETF XML
   Registry" [RFC3688]:

   URI: urn:ietf:params:xml:ns:yang:ietf-subscribed-notifications
   Registrant Contact: The IESG.
   XML: N/A; the requested URI is an XML namespace.

   This document registers the following YANG module in the "YANG Module
   Names" registry [RFC6020]:

   Name: ietf-subscribed-notifications
   Namespace: urn:ietf:params:xml:ns:yang:ietf-subscribed-notifications
   Prefix: sn
   Reference: draft-ietf-netconf-ietf-subscribed-notifications-08.txt
   (RFC form)

5.3.  Security Considerations

   For dynamic subscriptions the publisher MUST authenticate and
   authorize all RPC requests.

   Subscriptions could overload a publisher's CPU.  For this reason, the
   publisher MUST have the ability to decline a dynamic subscription
   request, and provide the appropriate RPC error response to a
   subscriber should the proposed subscription overly deplete the
   publisher's resources.

   A publisher needs to be able to suspend an existing dynamic or
   configured subscription based on capacity constraints.  When this
   occurs, the subscription status MUST be updated accordingly and the
   receivers notified with subscription state notifications.




Voit, et al.              Expires June 25, 2018                [Page 52]

Internet-Draft          Subscribed Notifications           December 2017


   If a malicious or buggy subscriber sends an unexpectedly large number
   of RPCs, the result might be an excessive use of system resources.
   In such a situation, subscription interactions MAY be terminated by
   terminating the transport session.

   For both configured and dynamic subscriptions the publisher MUST
   authenticate and authorize a receiver via some transport level
   mechanism before sending any updates.

   A secure transport is highly recommended and the publisher MUST
   ensure that the receiver has sufficient authorization to perform the
   function they are requesting against the specific subset of content
   involved.

   A publisher MUST NOT include any content in a notification message
   for which the receiver has not been authorized.

   With configured subscriptions, one or more publishers could be used
   to overwhelm a receiver.  No notification messages SHOULD be sent to
   any receiver which doesn't even support subscriptions.  Receivers
   that do not want notification messages need only terminate or refuse
   any transport sessions from the publisher.

   The NETCONF Authorization Control Model [RFC6536bis] SHOULD be used
   to control and restrict authorization of subscription configuration.
   This control models permits specifying per-receiver permissions to
   receive event records from specific streams.

   Where NACM is available, the NACM "very-secure" tag MUST be placed on
   the "kill-subscription" RPC so that only administrators have access
   to use this.

   One subscription id can be used for two or more receivers of the same
   configured subscription.  But due to the possibility of different
   access control permissions per receiver, it SHOULD NOT be assumed
   that each receiver is getting identical updates.

6.  Acknowledgments

   For their valuable comments, discussions, and feedback, we wish to
   acknowledge Andy Bierman, Tim Jenkins, Martin Bjorklund, Kent Watsen,
   Balazs Lengyel, Robert Wilton, Sharon Chisholm, Hector Trevino, Susan
   Hares, Michael Scharf, and Guangying Zheng.








Voit, et al.              Expires June 25, 2018                [Page 53]

Internet-Draft          Subscribed Notifications           December 2017


7.  References

7.1.  Normative References

   [I-D.draft-ietf-rtgwg-ni-model]
              Berger, L., Hopps, C., and A. Lindem, "YANG Network
              Instances", draft-ietf-rtgwg-ni-model-03 (work in
              progress), July 2017.

   [RFC2119]  Bradner, S., "Key words for use in RFCs to Indicate
              Requirement Levels", BCP 14, RFC 2119,
              DOI 10.17487/RFC2119, March 1997,
              <https://www.rfc-editor.org/info/rfc2119>.

   [RFC3688]  Mealling, M., "The IETF XML Registry", BCP 81, RFC 3688,
              DOI 10.17487/RFC3688, January 2004,
              <https://www.rfc-editor.org/info/rfc3688>.

   [RFC5277]  Chisholm, S. and H. Trevino, "NETCONF Event
              Notifications", RFC 5277, DOI 10.17487/RFC5277, July 2008,
              <https://www.rfc-editor.org/info/rfc5277>.

   [RFC6020]  Bjorklund, M., Ed., "YANG - A Data Modeling Language for
              the Network Configuration Protocol (NETCONF)", RFC 6020,
              DOI 10.17487/RFC6020, October 2010,
              <https://www.rfc-editor.org/info/rfc6020>.

   [RFC6536bis]
              Bierman, A. and M. Bjorklund, "Network Configuration
              Protocol (NETCONF) Access Control Model", draft-ietf-
              netconf-rfc6536bis-01 (work in progress), September 2017.

   [RFC7540]  Belshe, M., Peon, R., and M. Thomson, Ed., "Hypertext
              Transfer Protocol Version 2 (HTTP/2)", RFC 7540,
              DOI 10.17487/RFC7540, May 2015,
              <https://www.rfc-editor.org/info/rfc7540>.

   [RFC7950]  Bjorklund, M., Ed., "The YANG 1.1 Data Modeling Language",
              RFC 7950, DOI 10.17487/RFC7950, August 2016,
              <https://www.rfc-editor.org/info/rfc7950>.

   [XPATH]    Clark, J. and S. DeRose, "XML Path Language (XPath)
              Version 1.0", November 1999,
              <http://www.w3.org/TR/1999/REC-xpath-19991116>.







Voit, et al.              Expires June 25, 2018                [Page 54]

Internet-Draft          Subscribed Notifications           December 2017


7.2.  Informative References

   [I-D.draft-ietf-netconf-netconf-event-notifications]
              Clemm, Alexander., Voit, Eric., Gonzalez Prieto, Alberto.,
              Nilsen-Nygaard, E., Tripathy, A., Chisholm, S., and H.
              Trevino, "NETCONF support for event notifications",
              October 2016, <https://datatracker.ietf.org/doc/
              draft-ietf-netconf-netconf-event-notifications/>.

   [I-D.draft-ietf-netconf-restconf-notif]
              Voit, Eric., Clemm, Alexander., Tripathy, A., Nilsen-
              Nygaard, E., and Alberto. Gonzalez Prieto, "Restconf and
              HTTP transport for event notifications", August 2016,
              <https://datatracker.ietf.org/doc/
              draft-ietf-netconf-restconf-notif/>.

   [I-D.ietf-netconf-yang-push]
              Clemm, Alexander., Voit, Eric., Gonzalez Prieto, Alberto.,
              Tripathy, A., Nilsen-Nygaard, E., Bierman, A., and B.
              Lengyel, "YANG Datastore Subscription", October 2017,
              <https://datatracker.ietf.org/doc/
              draft-ietf-netconf-yang-push/>.

   [I.D.draft-ietf-netconf-notification-messages]
              Voit, Eric., Clemm, Alexander., Bierman, A., and T.
              Jenkins, "YANG Notification Headers and Bundles",
              September 2017, <https://datatracker.ietf.org/doc/
              draft-ietf-netconf-notification-messages>.

   [RFC6241]  Enns, R., Ed., Bjorklund, M., Ed., Schoenwaelder, J., Ed.,
              and A. Bierman, Ed., "Network Configuration Protocol
              (NETCONF)", RFC 6241, DOI 10.17487/RFC6241, June 2011,
              <https://www.rfc-editor.org/info/rfc6241>.

   [RFC7923]  Voit, E., Clemm, A., and A. Gonzalez Prieto, "Requirements
              for Subscription to YANG Datastores", RFC 7923,
              DOI 10.17487/RFC7923, June 2016,
              <https://www.rfc-editor.org/info/rfc7923>.

   [RFC8040]  Bierman, A., Bjorklund, M., and K. Watsen, "RESTCONF
              Protocol", RFC 8040, DOI 10.17487/RFC8040, January 2017,
              <https://www.rfc-editor.org/info/rfc8040>.

Appendix A.  Changes between revisions

   (To be removed by RFC editor prior to publication)

   v07 - v08



Voit, et al.              Expires June 25, 2018                [Page 55]

Internet-Draft          Subscribed Notifications           December 2017


   o  Split YANG trees to separate document subsections.

   o  Clarified configured state machine based on Balazs comments, and
      moved it into the configured subscription subsections.

   o  Normative reference to Network Instance model for VRF

   o  One transport protocol for all receivers of configured
      subscriptions.

   o  QoS section moved in from yang-push

   v06 - v07

   o  Clarification on state machine for configured subscriptions.

   v05 - v06

   o  Made changes proposed by Martin, Kent, and others on the list.
      Most significant of these are Stream returned to string (with the
      SYSLOG identity removed), intro section on 5277 relationship, an
      identity set moved to an enumeration, clean up of definitions/
      terminology, state machine proposed for configured subscriptions
      with a clean-up of susbcription state options.

   o  JSON and XML become features.  Also Xpath and subtree filtering
      become features

   o  Terminology updates with event records, and refinement of filters
      to just stream filters.

   o  Encoding refined in establish-subscription so it takes the RPC's
      encoding as the default.

   o  Namespaces in examples fixed.

   v04 - v05

   o  Returned to the explicit filter subtyping of v00

   o  stream object changed to 'name' from 'stream'

   o  Cleaned up examples

   o  Clarified that JSON support needs notification-messages draft.

   v03 - v04




Voit, et al.              Expires June 25, 2018                [Page 56]

Internet-Draft          Subscribed Notifications           December 2017


   o  Moved back to the use of RFC5277 one-way notifications and
      encodings.

   v03 - v04

   o  Replay updated

   v02 - v03

   o  RPCs and Notification support is identified by the Notification
      2.0 capability.

   o  Updates to filtering identities and text

   o  New error type for unsupportable volume of updates

   o  Text tweaks.

   v01 - v02

   o  Subscription status moved under receiver.

   v00 - v01

   o  Security considerations updated

   o  Intro rewrite, as well as scattered text changes

   o  Added Appendix A, to help match this to related drafts in progress

   o  Updated filtering definitions, and filter types in yang file, and
      moved to identities for filter types

   o  Added Syslog as a stream

   o  HTTP2 moved in from YANG-Push as a transport option

   o  Replay made an optional feature for events.  Won't apply to
      datastores

   o  Enabled notification timestamp to have different formats.

   o  Two error codes added.

   v01 5277bis - v00 subscribed notifications

   o  Kill subscription RPC added.




Voit, et al.              Expires June 25, 2018                [Page 57]

Internet-Draft          Subscribed Notifications           December 2017


   o  Renamed from 5277bis to Subscribed Notifications.

   o  Changed the notification capabilities version from 1.1 to 2.0.

   o  Extracted create-subscription and other elements of RFC5277.

   o  Error conditions added, and made specific in return codes.

   o  Simplified yang model structure for removal of 'basic' grouping.

   o  Added a grouping for items which cannot be statically configured.

   o  Operational counters per receiver.

   o  Subscription-id and filter-id renamed to identifier

   o  Section for replay added.  Replay now cannot be configured.

   o  Control plane notification renamed to subscription state
      notification

   o  Source address: Source-vrf changed to string, default address
      option added

   o  In yang model: 'info' changed to 'policy'

   o  Scattered text clarifications

   v00 - v01 of 5277bis

   o  YANG Model changes.  New groupings for subscription info to allow
      restriction of what is changeable via RPC.  Removed notifications
      for adding and removing receivers of configured subscriptions.

   o  Expanded/renamed definitions from event server to publisher, and
      client to subscriber as applicable.  Updated the definitions to
      include and expand on RFC 5277.

   o  Removal of redundancy with other drafts

   o  Many other clean-ups of wording and terminology

Authors' Addresses

   Eric Voit
   Cisco Systems

   Email: evoit@cisco.com



Voit, et al.              Expires June 25, 2018                [Page 58]

Internet-Draft          Subscribed Notifications           December 2017


   Alexander Clemm
   Huawei

   Email: ludwig@clemm.org


   Alberto Gonzalez Prieto
   VMWare

   Email: agonzalezpri@vmware.com


   Einar Nilsen-Nygaard
   Cisco Systems

   Email: einarnn@cisco.com


   Ambika Prasad Tripathy
   Cisco Systems

   Email: ambtripa@cisco.com





























Voit, et al.              Expires June 25, 2018                [Page 59]
